import { Box, Container, Stack, Typography, useTheme } from "@mui/material";

const Privacy = () => {
  const theme = useTheme();
  return (
    <Container sx={{ gap: 12 }}>
      <Stack display={"flex"} gap={6}>
        <Box>
          {" "}
          <Typography variant={"h5"} color={theme.palette.secondary.main}>
            Нууцлалын бодлого
          </Typography>
        </Box>
        <Box>
          {" "}
          <Typography
            variant="caption"
            textAlign={"match-parent"}
            color={theme.palette.primary.dark}
          >
            Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
            албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
            үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
            зохицуулахад оршино. <br />
            Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
            үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
            хэрэгжинэ. <br />
            Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
            байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
            хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
            худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
            вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
            харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
            авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
            баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> Энэхүү үйлчилгээний
            нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
            хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Энэхүү
            нөхцөл нь хэрэглэгч худалдан авалт хийх, <br />
            вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны
            үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд
            MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид
            хэрэглэгч гэх/ хамтран хяналт тавина. <br /> Mstars Food delivery нь
            Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд
            энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, <br /> худалдан
            авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино. Энэхүү
            нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ
            өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br />{" "}
            Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
            байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
            хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
            худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
            вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
            харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
            авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
            баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> Энэхүү үйлчилгээний
            нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
            хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Энэхүү
            нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ
            өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br />{" "}
            Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
            байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
            хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
            худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
            вэбсайтаар үйлчлүүлэх, <br /> худалдан авалт хийхтэй холбоотой үүсэх
            харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
            авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
            баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> Энэхүү үйлчилгээний
            нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
            хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Mstars Food
            delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны
            вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
            худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад
            оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
            үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
            хэрэгжинэ. <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars
            Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
            хамтран хяналт тавина. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт
            хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
            баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> Энэхүү үйлчилгээний
            нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
            хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
          </Typography>
        </Box>
      </Stack>
    </Container>
  );
};
export default Privacy;
